# Обзор архитектуры

## Лист
%Leaf

%Database %RepositoryId %ActorId %Actor %RecordId %ForeignKey
В центре база данных в которой все таблицы с тремя столбцами идентификаторов в каждой таблице - один для хранилища один для субъекта добавляющего или меняющего данные и один для строки данных созданной определенным субъектом.   Субъект это определенный пользователь использующий определенное приложение на определенном листе.   Идентификатор строки данных на практике это последовательность на таблицу в базе данных того листа где была создана это строка.  Все внешние ключи в базе данных состоят из этих идентификаторов.

%Framework %App %SQL %API %AccessRules %TransactionLog
На базе данных работает каркас для приложений позволяющий устанавливать приложения и позволяющий приложениям безопасно запускать SQL-запросы и вызывать программные оболочки друг друга.   Каркас проверят что приложения следуют правилам работы между собой и с базой данных, позволяя приложениям добавлять и изменять записи только в таблицах своей схемы данных.  Каркас также следит за правильным созданием записей в журналах изменений хранилищ.

%Libraries %App %DependencyInjection %ORM %API %Decorator
Для создания приложений Турбаза предоставляет библиотеки которые позволяют более продуктивно создавать и поддерживать приложения.  В их число входят фреймворки внедрения зависимостей, объектно-реляционного отображения, маркировки и создания пакетов программных оболочек.

%Synchronization %Connection %P2P %Cache %Encryption %TransactionLog
С каркасом работают модули синхронизации данных и соединения с другими Листами через ветку и прямой передачи данных между листами.   На Листе также есть кэш зашифрованных записей в журналах изменений.

## Ветка
%Branch

%Database %PublicData %FileSystem %LongTermStorage %PersistentQueue %TransactionLog %ConcurrentMap %Synchronization %Leaf %Framework %App
Ветка имеет базу данных с общественной информацией, файловую систему долгосрочного хранения журналов изменений хранилищ, быструю персистентную очередь для гарантированной записи приходящих записей в журналах изменений и параллельную карту для изменений которые еще не записаны в файловую систему.  Ветка синхронизирует хранилища между подключенными Листами и использует параллельную карту и файловую систему для синхронизации вновь подключенных Листов.  Для работы с базой данных общественной информации на ветке так же установлен каркас листа и работают приложения.

%PassThroughСonnection %Department %Branch %ParentBranch %Trunk
Ветка также поддерживает сквозное соединение Листов с ведомственными и другими Ветвями и соединяется со своей родительской Ветвью.  В свою очередь Ветви соединяются с родительскими ветвями которые в конце концов соединяются со стволом.

## Ветви и ствол
%ParentBranch %Trunk %Connection %PublicData %Analytics %DisasterRecovery %TreeSearch %Leaf %International %Connection

Ветви и ствол являются связными узлами платформы.  Они также дублируют общественную информацию их дочерних веток и ветвей позволяя проводить аналитику и являясь узлами аварийного восстановления.  Также на них создаются и хранятся древовидные сводные хранилища поиска соответствующего уровня которые позволяют проводить поиск прямо на Листах пользователей.  Стол также является международным соединительным узлом.